#  I
print("\t\tI")
# Даны два целых числа: D (день) и M (месяц), определяющие правиль-
# ную дату невисокосного года. Вывести значения D и M для даты, предше-
# ствующей указанной.

D = int(input("Введіть день (число): "))
M = int(input("Введіть місяць (число): "))
D -= 1
maxx = 0
if D == 0:
    M -= 1
    if M == 2:
        maxx = 28
    elif M == 4 or M == 9 or M == 11:
        maxx = 30
    else:
        maxx = 31
    D += maxx
    if M == 0:
        M += 12
if D < 10:
    D = "0" + str(D)
if M < 10:
    M = "0" + str(M)
print(f"Минула дата це {D}/{M}.")

#  II
print("\n\t\tII")
# Даны два целых числа: D (день) и M (месяц), определяющие правиль-
# ную дату невисокосного года. Вывести значения D и M для даты, следую-
# щей за указанной.

D = int(input("Введіть день (число): "))
M = int(input("Введіть місяць (число): "))
D += 1
maxx = 0
if M == 2:
    maxx = 28
elif M == 4 or M == 9 or M == 11:
    maxx = 30
else:
    maxx = 31
if D > maxx:
    D -= maxx
    M += 1
    if M > 12:
        M = 1
if D < 10:
    D = "0" + str(D)
if M < 10:
    M = "0" + str(M)
print(f"Наступна дата це {D}/{M}.")
