from math import sqrt

#  I
print("\t\tI")
# Дни недели пронумерованы следующим образом: 1 — понедельник, 2 — вторник,
# ..., 6 — суббота, 7 — воскресенье. Дано целое число K, лежащее в диапазоне 1–365.
# Определить номер дня недели для K-го дня года, если известно, что в этом году 1 января было субботой.

K = int(input("Введіть ціле додатнє число K від 1 до 365 (день): ")) # 1, 5
n = (K+4) % 7 # 6, 3
print("Номер у тижні для дня", K, "буде", n+1)

#  II
print("\n\t\tII")
# Дан номер некоторого года (целое положительное число).
# Определить соответствующий ему номер столетия, учитывая, что, к примеру, началом 20 столетия был 1901 год.

n = int(input("Введіть ціле додатнє число n (рік): ")) # 1994, 1789, 980
a = n // 100
b = n % 100
c = 100 - b
s = a - c//100 + 1 # 20, 18, 10
print(n, "рік буде належати", s, "століттю.")

#  III
print("\n\t\tIII")
# Даны целые положительные числа A, B, C. На прямоугольнике размера A × B размещено максимально возможное количество квадратов со
# стороной C (без наложений). Найти количество квадратов, размещенных на прямоугольнике, а также площадь незанятой части прямоугольника.

A = int(input("Введіть ціле додатнє число A: ")) # 7
B = int(input("Введіть ціле додатнє число B: ")) # 15
C = int(input("Введіть ціле додатнє число C: ")) # 3
a = A // C
b = B // C
n = a * b # 10
S_AB = A * B
S_C = C**2
S = S_AB - n * S_C # 15
print("У прямокутнику зі сторонами", A, "і", B, "поміститься", n, "квадратів зі сторонами", C, ". Площа вільного місця у прямокутнику =", S)

#  IV
print("\n\t\tIV")
# Скорость первого автомобиля V1 км/ч, второго — V2 км/ч, расстояние между ними S км.
# Определить расстояние между ними через T часов, если автомобили первоначально движутся навстречу друг другу.

V1 = float(input("Введіть значення швидкості V1 у км/год: ")) # 5
V2 = float(input("Введіть значення швидкості V2 у км/год: ")) # 7
S = float(input("Введіть значення відстані між автомобілями S у км: ")) # 20
T = float(input("Введіть значення часу T у год: ")) # 7
V = V1 + V2 # закон додавання швидкостей. 12
s = abs(V * T - S) # 64
print("Відстань між автомобілями за час", T, "год при початковій відстані", S,
      "км, де швидкість першого", V1, "км/год та другого", V2, "км/год буде становити", s, "км.")

#  V
print("\n\t\tV")
# Даны координаты трех вершин треугольника: (x1, y1), (x2, y2), (x3, y3).
# Найти его периметр и площадь. Для нахождения площади треугольника со сторонами a, b, c использовать формулу Герона.

x1 = float(input("Введіть значення координат x1: ")) # -2
y1 = float(input("Введіть значення координат y1: ")) # -1
x2 = float(input("Введіть значення координат x2: ")) # 0
y2 = float(input("Введіть значення координат y2: ")) # 3
x3 = float(input("Введіть значення координат x3: ")) # 2
y3 = float(input("Введіть значення координат y3: ")) # 1

a = sqrt(pow((x2 - x1), 2) + pow((y2 - y1), 2)) # 4.47
b = sqrt(pow((x3 - x2), 2) + pow((y3 - y2), 2)) # 2.83
c = sqrt(pow((x1 - x3), 2) + pow((y1 - y3), 2)) # 4.47
P = a + b + c # 11.77
S = sqrt(P/2 * (P/2 - a) * (P/2 - b) * (P/2 - c)) # P/2 = 5.89; 6

print("Для трикутника із координатами вершин (", x1, ";", y1, "), (", x2, ";", y2,
      "), (", x3, ";", y3, ") периметр буде дорівнювати", P, "; площа", S)
