#  I
print("\t\tI")
# Дано целое число N (> 1). Вывести наибольшее из целых чисел K, для
# которых сумма 1 + 2 + ... + K будет меньше или равна N, и саму эту сумму.

N = int(input("Введіть N: "))
K = 0
summ = 0
while summ <= N:
    K += 1
    summ += K
print(f"{K - 1} буде найбільш можливою кількістю цілих чисел, сума яких ({summ - K}) <= {N}")

#  II
print("\n\t\tII")
# Дано число A (> 1). Вывести наибольшее из целых чисел K, для кото-
# рых сумма 1 + 1/2 + ... + 1/K будет меньше A, и саму эту сумму.

A = float(input("Введіть A: "))
K = 0
summ = 0
while summ <= A:
    K += 1
    summ += 1/K
print(f"{K - 1} буде найбільш можливою кількістю цілих чисел, сума яких ({summ - 1 / K}) <= {A}")

#  III
print("\n\t\tIII")

N = int(input("Введіть N: "))
i = 1
summ = 0
while i <= N:
    m = int(str(i) + str(i))
    summ += m
    i += 1
    print(m, end=' + ')
print(f"= {summ}")
