#  I
print("\t\tI")
# Даны числа x, y, x1, y1, x2, y2. Проверить истинность высказывания:
# «Точка с координатами (x, y) лежит внутри прямоугольника, левая верхняя
# вершина которого имеет координаты (x1, y1), правая нижняя — (x2, y2), а
# стороны параллельны координатным осям».

x = float(input("Введіть значення координати x: ")) # 0, 2, 4
y = float(input("Введіть значення координати y: ")) # 2, 1, 3
x1 = float(input("Введіть значення координати x1: ")) # -1
y1 = float(input("Введіть значення координати y1: ")) # 3
x2 = float(input("Введіть значення координати x2: ")) # 4
y2 = float(input("Введіть значення координати y2: ")) # -1
res = (x1 > x > x2 or x2 > x > x1) and (y1 > y > y2 or y2 > y > y1)
print(res)

#  II
print("\n\t\tII")
# Дано трехзначное число. Проверить истинность высказывания:
# «Цифры данного числа образуют возрастающую или убывающую последовательность».

n = int(input("Введіть трьохзначне число: "))
n1 = n // 100
n2 = n // 10 % 10
n3 = n % 10
res = n1 < n2 < n3 or n1 > n2 > n3
print(res)

#  III
print("\n\t\tIII")
# Даны числа A, B, C (число А не равно 0). Рассмотрев дискриминант
# D = B*B - 4*A*C, проверить истинность высказывания:
# «Квадратное уравнение Ax^2 + Bx + C = 0 имеет вещественные корни».

A = float(input("Введіть значення змінної А: ")) # 2, 1
B = float(input("Введіть значення змінної В: ")) # 4, 1
C = float(input("Введіть значення змінної С: ")) # 2, -2
D = B**2 - 4*A*C
res = not (D < 0)
print(res)

#  IV
print("\n\t\tIV")
# Даны числа x, y. Проверить истинность высказывания:
# «Точка с координатами (x, y) лежит во второй или
# третьей координатной четверти».

x = float(input("Введіть значення координати x: "))
y = float(input("Введіть значення координати y: "))
res = x < 0 and (y > 0 or y < 0)
print(res)
