#  I
print("\t\tI")
# Даны положительные числа A, B, C. На прямоугольнике размера A × B
# размещено максимально возможное количество квадратов со стороной C
# (без наложений). Найти количество квадратов, размещенных на прямо-
# угольнике, і площу незайнятої частини. Операции умножения и деления не использовать.

A = float(input("Введіть додатнє число A: ")) # 7
B = float(input("Введіть додатнє число B: ")) # 15
C = float(input("Введіть додатнє число C: ")) # 3
AA = A
a = 0
while AA >= C:  # a = A // C
    AA -= C
    a += 1
BB = B
b = 0
while BB >= C:  # b = B // C
    BB -= C
    b += 1
n = 0
while b > 0:  # n = a * b  # 10
    n += a
    b -= 1
AA = A
BB = B
S_ab = 0
while BB > 0:  # S_ab = A * B
    S_ab += AA
    BB -= 1
D = C
S_c = 0
while D > 0:  # S_c = C**2
    S_c += C
    D -= 1
N = n
S_n = 0
while n > 0:  # n * S_C
    S_n += S_c
    n -= 1
S = S_ab - S_n  # 15
print(f"У прямокутнику зі сторонами {A} і {B} поміститься {N} квадратів зі сторонами {C}. Площа вільного місця у прямокутнику = {S}")

#  II
print("\n\t\tII")
# Дано целое число N (> 1). Если оно является простым, то есть не
# имеет положительных делителей, кроме 1 и самого себя, то вывести True,
# иначе вывести False.

N = int(input("Введіть ціле додатнє число N (> 1): "))
n = 1
deviders = 0
while n <= N:
    if N % n == 0:
        deviders += 1
    n += 1
print(deviders == 2)  # 2, 3, 5, 7, 11, 13, 17, 19, 23 ...

#  III
print("\n\t\tIII")
# Начальный вклад в банке равен 1000 грн. Через каждый месяц размер
# вклада увеличивается на P процентов от имеющейся суммы (P — вещест-
# венное число, 0 < P < 25). По данному P определить, через сколько меся-
# цев размер вклада превысит 1100 грн., и вывести найденное количество
# месяцев K (целое число) и итоговый размер вклада S (вещественное число).

P = float(input("Введіть відсоток P (1-25%) = "))  # 1
K = 0  # 10
S = 1000  # 1104.62
add = 0
while S <= 1100:
    add = S / 100 * P
    S += add
    K += 1
print(f"Розмір вкладу перевищить 1100 грн. за {K} місяців і буде дорівнювати {round(S, 2)} грн.")

#  IV
print("\n\t\tIV")
# Из заданного натурального числа n удалить все четные цифры.
# Вивести нове ЧИСЛО!!!!!

n = int(input("Введіть натуральне число n: "))
m = n
p = 1
n = 0
while m > 0:
    r = m % 10
    if r % 2 != 0:
        n += r * p
        p *= 10
    m //= 10
print(n)
