#  I
print("\t\tI")
# Даны координаты двух различных полей шахматной доски x1, y1,
# x2, y2 (целые числа, лежащие в диапазоне 1–8). Проверить истинность вы-
# сказывания: «Король за один ход может перейти с одного поля на другое».

x1 = int(input("Введіть координату x1: "))
y1 = int(input("Введіть координату y1: "))
x2 = int(input("Введіть координату x2: "))
y2 = int(input("Введіть координату y2: "))
res = abs(y2 - y1) <= 1 and abs(x2 - x1) <= 1
print(f"Якщо король стоїть на клітинці з координатами ({x1}; {y1}), то можливість походити на клітинку ({x2}; {y2}) є   {res}")

#  II
print("\n\t\tII")
# Даны координаты двух различных полей шахматной доски x1, y1,
# x2, y2 (целые числа, лежащие в диапазоне 1–8). Проверить истинность вы-
# сказывания: «Ферзь за один ход может перейти с одного поля на другое».

x1 = int(input("Введіть координату x1: "))
y1 = int(input("Введіть координату y1: "))
x2 = int(input("Введіть координату x2: "))
y2 = int(input("Введіть координату y2: "))
res = x1 == x2 or y1 == y2 or abs(x1 - x2) == abs(y1 - y2)
print(f"Якщо ферзь стоїть на клітинці з координатами ({x1}; {y1}), то можливість походити на клітинку ({x2}; {y2}) є   {res}")

#  III
print("\n\t\tIII")
# Даны координаты двух различных полей шахматной доски x1, y1,
# x2, y2 (целые числа, лежащие в диапазоне 1–8). Проверить истинность вы-
# сказывания: «Конь за один ход может перейти с одного поля на другое».

x1 = int(input("Введіть координату x1: "))
y1 = int(input("Введіть координату y1: "))
x2 = int(input("Введіть координату x2: "))
y2 = int(input("Введіть координату y2: "))
res = (abs(x2 - x1) == 2 and abs(y2 - y1) == 1) or (abs(y2 - y1) == 2 and abs(x2 - x1) == 1)
print(f"Якщо кінь стоїть на клітинці з координатами ({x1}; {y1}), то можливість походити на клітинку ({x2}; {y2}) є   {res}")
