# - + унарні
# = + - * / ** % // += -= *= /= **= %= //= бінарні
'''
a = -3
b = 4
a = a + b # a += b операція з одночасним присвоєнням
c = a + b  # бінарний плюс
c = -a  # унарний мінус
c = (2 + 2) * 2  # оператор круглі дужки
c = 2**3*2  # степінь має вищій пріоритет
print(15.5 / 5)
print(15.5 // 5)
'''

# a = float(input("Значення сторони a прямокутника: "))
# b = float(input("Значення сторони b прямокутника: "))
# S = a*b
# P = 2*(a+b)
# print("Значення площини прямокутника зі сторонами", a, "і", b, "=", S,
#       "\nЗначення периметру прямокутника зі сторонами", a, "і", b, "=", P)

# x_1 = int(input("x1 = "))
# x_2 = int(input("x2 = "))
# s = abs(x_1 - x_2)
# print("s =", s)

# a = float(input("A = "))  # 5; -1
# b = float(input("B = "))  # 1; 6
# c = float(input("C = "))  # 4; 3
# ac = abs(a - c)
# bc = abs(c - b)
# print("AC*BC =", ac*bc)

# a = 5
# b = 4
# print(a, b)
# c = a
# a = b
# b = c
# # a1 = b
# # b1 = a
# # a = a1
# # b = b1
# print(a, b)

# n = int(input("n = "))
# n1 = n // 10
# n2 = n % 10
# print("n1 + n2 =", n1 + n2, "\nn1 * n2 =", n1 * n2)

# n = int(input("n = "))
# n1 = n % 10
# n2 = (n // 10) % 10
# print("n1 =", n1, "\nn2 =", n2)

n = int(input("n = "))
n1 = n % 10
n2 = n // 10
n3 = n1*100 + n2
print(n3)
